In [1]:
# Import Libraries

In [2]:
import pyodbc
import pandas as pd
from sqlalchemy import create_engine

In [3]:
# Create a Connection String

In [5]:
from sqlalchemy import create_engine

# Sql Server 
server = 'DESKTOP-81UAMGN\\SQLEXPRESS'  
database = 'Consumer_Segmentation'

# Create a connection string with Windows Authentication
connection_string = f'mssql+pyodbc://{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes'

# Create a SQLAlchemy engine
engine = create_engine(connection_string)

In [6]:
# Read / import  csv File

In [7]:
data_frame = pd.read_csv('Test.csv')

In [8]:
# Head of DataFrame

In [9]:
data_frame.head(5) # show 5 rows

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6
2,458996,Female,Yes,69,No,NaN,0.0,Low,1.0,Cat_6
3,459000,Male,Yes,59,No,Executive,11.0,High,2.0,Cat_6
4,459001,Female,No,19,No,Marketing,NaN,Low,4.0,Cat_6

In [10]:
# Shape of DataFrame

In [11]:
data_frame.shape

(2627, 10)

In [12]:
# Check columns

In [13]:
data_frame.columns

Index(['ID', 'Gender', 'Ever_Married', 'Age', 'Graduated', 'Profession',
       'Work_Experience', 'Spending_Score', 'Family_Size', 'Var_1'],
      dtype='object')

In [14]:
# Summary of DataFrame

In [15]:
data_frame.describe()

                  ID          Age  Work_Experience  Family_Size
count    2627.000000  2627.000000      2358.000000  2514.000000
mean   463433.918919    43.649791         2.552587     2.825378
std      2618.245698    16.967015         3.341094     1.551906
min    458989.000000    18.000000         0.000000     1.000000
25%    461162.500000    30.000000         0.000000     2.000000
50%    463379.000000    41.000000         1.000000     2.000000
75%    465696.000000    53.000000         4.000000     4.000000
max    467968.000000    89.000000        14.000000     9.000000

In [16]:
# Check null values

In [17]:
null_values = data_frame.isna() 
print(null_values) # print null values

         ID  Gender  Ever_Married    Age  Graduated  Profession  \
0     False   False         False  False      False       False
1     False   False         False  False      False       False
2     False   False         False  False      False        True
3     False   False         False  False      False       False
4     False   False         False  False      False       False
...     ...     ...           ...    ...        ...         ...
2622  False   False         False  False      False       False
2623  False   False         False  False      False       False
2624  False   False         False  False      False       False
2625  False   False         False  False      False       False
2626  False   False         False  False      False       False

      Work_Experience  Spending_Score  Family_Size  Var_1
0               False           False        False  False
1               False           False        False  False
2               False           False        False  False
3               False           False        False  False
4                True           False        False  False
...               ...             ...          ...    ...
2622            False           False        False  False
2623            False           False        False  False
2624             True           False        False  False
2625            False           False        False  False
2626            False           False        False  False

[2627 rows x 10 columns]

In [18]:
# Check columns  Have Missing value

In [19]:
missisng_columns_values= data_frame.isna().any()
print(missisng_columns_values) # print missisng_columns

ID                 False
Gender             False
Ever_Married        True
Age                False
Graduated           True
Profession          True
Work_Experience     True
Spending_Score     False
Family_Size         True
Var_1               True
dtype: bool

In [20]:
# remove missing values

In [21]:
drop_NullRows = data_frame.dropna(axis = 0)
data_frame.dropna(inplace = True)

In [22]:
# check for duplicates

In [23]:
data_frame.duplicated().any()

False

In [24]:
# Drop Column

In [25]:
data_frame.drop('Var_1', axis=1, inplace=True)

In [26]:
# Import secod file into data frame

In [27]:
df2 = pd.read_csv('Train.csv')

In [28]:
# Head of dataframe

In [29]:
df2.head(5) # show 5 rows

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [30]:
# check shape

In [31]:
df2.shape

(8068, 11)

In [32]:
# Check Null values

In [33]:
null_values = df2.isna()
print(null_values) #print null values

         ID  Gender  Ever_Married    Age  Graduated  Profession  \
0     False   False         False  False      False       False
1     False   False         False  False      False       False
2     False   False         False  False      False       False
3     False   False         False  False      False       False
4     False   False         False  False      False       False
...     ...     ...           ...    ...        ...         ...
8063  False   False         False  False      False        True
8064  False   False         False  False      False       False
8065  False   False         False  False      False       False
8066  False   False         False  False      False       False
8067  False   False         False  False      False       False

      Work_Experience  Spending_Score  Family_Size  Var_1  Segmentation
0               False           False        False  False         False
1                True           False        False  False         False
2               False           False        False  False         False
3               False           False        False  False         False
4                True           False        False  False         False
...               ...             ...          ...    ...           ...
8063            False           False        False  False         False
8064            False           False        False  False         False
8065            False           False        False  False         False
8066            False           False        False  False         False
8067            False           False        False  False         False

[8068 rows x 11 columns]

In [34]:
# check duplicate

In [35]:
df2.duplicated().any()

False

In [36]:
# drop column

In [37]:
df2.drop('Var_1', axis=1, inplace=True)

In [38]:
# Import third file into dataframe

In [39]:
df3 = pd.read_csv('sample_submission.csv')

In [40]:
# Head of dataframe

In [41]:
df3.head(5) #show 5 rows

       ID Segmentation
0  458989            A
1  458994            A
2  458996            A
3  459000            A
4  459001            A

In [42]:
# check shape

In [43]:
df3.shape

(2627, 2)

In [44]:
# check for duplicates

In [45]:
df3.duplicated().any()

False

In [46]:
# Check for null values

In [47]:
null_values = df3.isna()
print(null_values) #print null values

         ID  Segmentation
0     False         False
1     False         False
2     False         False
3     False         False
4     False         False
...     ...           ...
2622  False         False
2623  False         False
2624  False         False
2625  False         False
2626  False         False

[2627 rows x 2 columns]

In [48]:
# Create Tables From Dataframes To SQL Server

In [49]:
data_frame.to_sql('Test_Table_Of_Consumer', engine, index=False, if_exists='replace')
df2.to_sql('Train_Table_Of_Consumer', engine, index=False, if_exists='replace')
df3.to_sql('Sample_Of_Consumer_Segmentation', engine, index=False, if_exists='replace')

627

In [50]:
# Insert values  Into Tables Created

In [51]:
new_test_df = pd.read_csv('Test.csv') # Reload the csv file
print(new_test_df.info())

new_test_df = new_test_df.drop(columns=['Var_1'], errors='ignore') # drop var_1 column explicitly

new_test_df.to_sql('Test_Table_Of_Consumer',engine, index=False, if_exists='append') # insert values in dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2627 entries, 0 to 2626
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2627 non-null   int64
 1   Gender           2627 non-null   object
 2   Ever_Married     2577 non-null   object
 3   Age              2627 non-null   int64
 4   Graduated        2603 non-null   object
 5   Profession       2589 non-null   object
 6   Work_Experience  2358 non-null   float64
 7   Spending_Score   2627 non-null   object
 8   Family_Size      2514 non-null   float64
 9   Var_1            2595 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 205.4+ KB
None

64

In [52]:
new_train_df = pd.read_csv('Train.csv') # Reload the csv file

new_train_df = new_train_df.drop(columns=['Var_1'], errors='ignore') # drop var_1 column explicitly

new_train_df.to_sql('Train_Table_Of_Consumer',engine, index=False, if_exists='append') # insert values in dataframe

126

In [53]:
new_data_sample= pd.read_csv('sample_submission.csv')  # Reload the csv file
new_data_sample.to_sql('Sample_Of_Consumer_Segmentation', engine, index=False, if_exists='append') # insert values in dataframe

627

In [58]:
# Show Tables Created

In [57]:
from sqlalchemy import create_engine, inspect

engine = create_engine(f'mssql+pyodbc://{server}/{database}?driver=ODBC+Driver+17+for+SQL+Server&Trusted_Connection=yes')

# Create an inspector
inspector = inspect(engine)

# Get a list of table names
table_names = inspector.get_table_names()

# Print the list of table names
print("Tables in the database:")
for table_name in table_names:
    print(table_name)

Tables in the database:
Sample_Of_Consumer_Segmentation
Test_Table_Of_Consumer
Train_Table_Of_Consumer